In [176]:
import pandas as pd
import numpy as np

In [182]:
fx = pd.read_csv('fx_men.csv')
sr = pd.read_csv('sr_men.csv')
vt = pd.read_csv('vt_men.csv')
pb = pd.read_csv('pb_men.csv')
ph = pd.read_csv('ph_men.csv')
hb = pd.read_csv('hb_men.csv')

In [183]:
fxus=fx[fx['Country']=='USA']
srus=sr[sr['Country']=='USA']
vtus=vt[vt['Country']=='USA']
pbus=pb[pb['Country']=='USA']
phus=ph[ph['Country']=='USA']
hbus=hb[hb['Country']=='USA']

In [184]:
fx=fxus.drop(columns=['Country', 'Competition', 'Round', 'year', 'Apparatus'])
sr=srus.drop(columns=['Country', 'Competition', 'Round', 'year', 'Apparatus'])
vt=vtus.drop(columns=['Country', 'Competition', 'Round', 'year', 'Apparatus'])
pb=pbus.drop(columns=['Country', 'Competition', 'Round', 'year', 'Apparatus'])
ph=phus.drop(columns=['Country', 'Competition', 'Round', 'year', 'Apparatus'])
hb=hbus.drop(columns=['Country', 'Competition', 'Round', 'year', 'Apparatus'])

# fx

In [203]:
fx['name'] = fx['name'].replace('frederick richard', 'frederick nathaniel richard')

name_counts = fx['name'].value_counts()

# Filter out entries with only one occurrence
fx_filtered = fx[fx['name'].isin(name_counts.index[name_counts > 1])]

In [207]:
fx=fx_filtered.copy()
# Replace 'frederick richard' with 'frederick nathaniel richard' for consistency

# Group by the 'name' column and calculate the mean of other columns
fxavg = fx.groupby('name').mean().reset_index()

In [208]:
fxavg = fx.groupby('name').mean().reset_index()

In [209]:
fx_sorted = fxavg.sort_values(by='Score', ascending=False)

In [210]:
fx_sorted['Apparatus'] = 'fx'

In [211]:
fx_sorted.info()

<class 'pandas.core.frame.DataFrame'>
Index: 41 entries, 31 to 34
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       41 non-null     object
 1   Rank       41 non-null     float64
 2   D_Score    41 non-null     float64
 3   E_Score    41 non-null     float64
 4   Penalty    41 non-null     float64
 5   Score      41 non-null     float64
 6   Apparatus  41 non-null     object
dtypes: float64(5), object(2)
memory usage: 2.6+ KB

# sr

In [212]:
sr['name'] = sr['name'].replace('frederick richard', 'frederick nathaniel richard')

name_counts = sr['name'].value_counts()

# Filter out entries with only one occurrence
sr_filtered = sr[sr['name'].isin(name_counts.index[name_counts > 1])]

In [213]:
sr=sr_filtered.copy()
sravg = sr.groupby('name').mean().reset_index()

In [214]:
sr_sorted = sravg.sort_values(by='Score', ascending=False)

In [215]:
sr_sorted['Apparatus'] = 'sr'

In [216]:
sr_sorted.info()

<class 'pandas.core.frame.DataFrame'>
Index: 42 entries, 9 to 35
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       42 non-null     object
 1   Rank       42 non-null     float64
 2   D_Score    42 non-null     float64
 3   E_Score    42 non-null     float64
 4   Penalty    42 non-null     float64
 5   Score      42 non-null     float64
 6   Apparatus  42 non-null     object
dtypes: float64(5), object(2)
memory usage: 2.6+ KB

# vt

In [217]:
vt['name'] = vt['name'].replace('frederick richard', 'frederick nathaniel richard')

name_counts = vt['name'].value_counts()

# Filter out entries with only one occurrence
vt_filtered = vt[vt['name'].isin(name_counts.index[name_counts > 1])]

In [218]:
vt=vt_filtered.copy()
vtavg = vt.groupby('name').mean().reset_index()

In [219]:
vt_sorted = vtavg.sort_values(by='Score', ascending=False)

In [220]:
vt_sorted['Apparatus'] = 'vt'

In [221]:
vt_sorted.info()

<class 'pandas.core.frame.DataFrame'>
Index: 35 entries, 21 to 29
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       35 non-null     object
 1   Rank       35 non-null     float64
 2   D_Score    35 non-null     float64
 3   E_Score    35 non-null     float64
 4   Penalty    35 non-null     float64
 5   Score      35 non-null     float64
 6   Apparatus  35 non-null     object
dtypes: float64(5), object(2)
memory usage: 2.2+ KB

# pb

In [227]:
pb['name'] = pb['name'].replace('frederick richard', 'frederick nathaniel richard')

name_counts = pb['name'].value_counts()

# Filter out entries with only one occurrence
pb_filtered = pb[pb['name'].isin(name_counts.index[name_counts > 1])]

In [228]:
pb=pb_filtered.copy()
pbavg = pb.groupby('name').mean().reset_index()

In [229]:
pb_sorted = pbavg.sort_values(by='Score', ascending=False)

In [230]:
pb_sorted['Apparatus'] = 'pb'

In [233]:
pb_sorted.info()

<class 'pandas.core.frame.DataFrame'>
Index: 47 entries, 8 to 19
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       47 non-null     object
 1   Rank       47 non-null     float64
 2   D_Score    47 non-null     float64
 3   E_Score    47 non-null     float64
 4   Penalty    47 non-null     float64
 5   Score      47 non-null     float64
 6   Apparatus  47 non-null     object
dtypes: float64(5), object(2)
memory usage: 2.9+ KB

# ph

In [234]:
ph['name'] = ph['name'].replace('frederick richard', 'frederick nathaniel richard')

In [235]:
name_counts = ph['name'].value_counts()

# Filter out entries with only one occurrence
ph_filtered = ph[ph['name'].isin(name_counts.index[name_counts > 1])]

In [236]:
ph=ph_filtered.copy()
phavg = ph.groupby('name').mean().reset_index()

In [237]:
ph_sorted = phavg.sort_values(by='Score', ascending=False)

In [238]:
ph_sorted['Apparatus'] = 'ph'

In [239]:
ph_sorted.info()

<class 'pandas.core.frame.DataFrame'>
Index: 47 entries, 38 to 20
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       47 non-null     object
 1   Rank       47 non-null     float64
 2   D_Score    47 non-null     float64
 3   E_Score    47 non-null     float64
 4   Penalty    47 non-null     float64
 5   Score      47 non-null     float64
 6   Apparatus  47 non-null     object
dtypes: float64(5), object(2)
memory usage: 2.9+ KB

# hb

In [245]:
hb['name'] = hb['name'].replace('frederick richard', 'frederick nathaniel richard')

In [246]:
name_counts = hb['name'].value_counts()

# Filter out entries with only one occurrence
hb_filtered = hb[hb['name'].isin(name_counts.index[name_counts > 1])]

In [247]:
hb=hb_filtered.copy()
hbavg = hb.groupby('name').mean().reset_index()

In [248]:
hb_sorted = hbavg.sort_values(by='Score', ascending=False)

In [249]:
hb_sorted['Apparatus'] = 'hb'

In [250]:
hb_sorted.info()

<class 'pandas.core.frame.DataFrame'>
Index: 44 entries, 1 to 13
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       44 non-null     object
 1   Rank       44 non-null     float64
 2   D_Score    44 non-null     float64
 3   E_Score    44 non-null     float64
 4   Penalty    44 non-null     float64
 5   Score      44 non-null     float64
 6   Apparatus  44 non-null     object
dtypes: float64(5), object(2)
memory usage: 2.8+ KB

In [251]:
hb=hb_sorted.copy()
vt=vt_sorted.copy()
sr=sr_sorted.copy()
fx=fx_sorted.copy()
pb=pb_sorted.copy()
ph=ph_sorted.copy()

In [252]:
hb.head(1)

           name  Rank  D_Score  E_Score  Penalty    Score Apparatus
1  brody malone   2.2     6.05   8.3532      0.0  14.4032        hb

In [253]:
vt.head(1)

          name   Rank  D_Score   E_Score  Penalty      Score Apparatus
21  khoi young  4.125    5.425  9.339375    0.025  14.739375        vt

In [254]:
sr.head(1)

                  name  Rank  D_Score  E_Score  Penalty    Score Apparatus
9  donnell whittenburg   3.9     5.98   8.4398      0.0  14.4198        sr

In [255]:
fx.head(1)

         name  Rank  D_Score  E_Score  Penalty     Score Apparatus
31  paul juda  12.0     5.65  8.56225    0.025  14.18725        fx

In [256]:
pb.head(1)

              name      Rank   D_Score   E_Score  Penalty      Score Apparatus
8  curran phillips  2.111111  6.733333  8.029556      0.0  14.762889        pb

In [257]:
ph.head(1)

                  name  Rank   D_Score   E_Score  Penalty      Score Apparatus
38  stephen nedoroscik   3.0  6.414286  7.840286      0.0  14.254571        ph

In [258]:
df = pd.concat([hb, vt, sr, fx, pb, ph], ignore_index=True)

In [259]:
df

,name,Rank,D_Score,E_Score,Penalty,Score,Apparatus
0,brody malone,2.200000,6.050000,8.353200,0.00,14.403200,hb
1,paul juda,3.800000,5.360000,8.666400,0.00,14.026400,hb
2,frederick nathaniel richard,24.166667,5.833333,7.761000,0.05,13.544333,hb
3,fred richard,11.333333,5.733333,7.783333,0.00,13.516667,hb
4,michael jaroh,6.000000,5.150000,8.350000,0.00,13.500000,hb
...,...,...,...,...,...,...,...
251,kameron nelson,32.000000,3.600000,6.700000,0.00,10.300000,ph
252,tyler flores,47.000000,4.400000,5.625000,0.00,10.025000,ph
253,kazuki hayashi,48.000000,3.850000,5.975000,0.00,9.825000,ph
254,drake andrews,47.500000,3.400000,7.925000,2.00,9.325000,ph
255,izaiha mlay,53.500000,3.350000,5.000000,0.00,8.350000,ph

In [260]:
# df.to_csv('usa_men_apparatus.csv', index=False)